app/app/controllers/dids_controller.rb

  def index
    @dids = Did.all
---
SELECT `dids`.* FROM `dids`

  def create
    items = did_params[:items].delete_if{|k,v| v.blank? }
    @did = Did.new(day: did_params[:day], items: )

    respond_to do |format|
      if @did.save
---
INSERT INTO `dids` (`items`, `day`, `created_at`, `updated_at`) VALUES ('{\"0\":\"30\",\"1\":\"60\"}', '2025-08-21', '2025-08-21 18:46:36.982445', '2025-08-21 18:46:36.982445')

  def update
    respond_to do |format|
      items = did_params[:items].delete_if{|k,v| v.blank? }
      if @did.update(day: did_params[:day], items: )
---
UPDATE `dids` SET `dids`.`items` = '{\"0\":\"\",\"1\":\"\",\"2\":\"\",\"3\":\"\",\"4\":\"\",\"5\":\"\",\"6\":\"\",\"7\":\"\",\"8\":\"\",\"9\":\"\",\"10\":\"\",\"11\":\"30\",\"12\":\"30\"}', `dids`.`updated_at` = '2025-08-21 18:00:15.884535' WHERE `dids`.`id` = 2

    def set_did
      @did = Did.find(params.expect(:id))
---
SELECT `dids`.* FROM `dids` WHERE `dids`.`id` = 1 LIMIT 1